#include <stdio.h>
#include <stdlib.h>

void PrintArrA(int (*ptr)[3][3], int n)
{

    printf("PrintArrA(int (*ptr)[3][3], int n)\n");
    printf("按列打印所有元素:");
    int *p1 = **ptr; //二维数组地址
    for (int i = 0; i < n; i++)
    {
        printf("%d ", *p1);
        p1++;
    }
    puts("");
    
    printf("打印每行首元素元素:");
    int (*p2)[3] = *ptr; //进行*操作，将二维数组地址降级为一维数组地址(行地址)
    for (int i = 0; i < 3; i++)
    {
        printf("%d ", **p2);
        p2++;
    }
    puts("");
    puts("");
}

void PrintArrB(int (*ptr)[3], int n)  
{
    printf("PrintArrB(int (*ptr)[3], int n)\n");
    printf("按列打印所有元素:");
    int *p = *ptr;
    for (int i = 0; i < n; i++)
    {
        printf("%d ", *p);
        p++;
    }
    puts("");
    puts("");
}

void PrintArrC(int (*ptr)[3], int n)
{

    printf("PrintArrC(int (*ptr)[3], int n)\n");
    printf("按列打印所有元素:");
    int *p1 = *ptr; //二维数组地址
    for (int i = 0; i < n; i++)
    {
        printf("%d ", *p1);
        p1++;
    }
    puts("");
    
    printf("打印每行首元素元素:");
    int (*p2)[3] = ptr; //进行*操作，将二维数组地址降级为一维数组地址(行地址)
    for (int i = 0; i < 3; i++)
    {
        printf("%d ", **p2);
        p2++;
    }
    puts("");
    puts("");
}

void PrintArrD(int* ptr, int n)  
{
    printf("PrintArrD(int* ptr, int n)\n");
    printf("按列打印所有元素:");
    int *p = ptr;
    for (int i = 0; i < n; i++)
    {
        printf("%d ", *p);
        p++;
    }
    puts("");
    puts("");
}
int main()
{

    // 重点：arr[] 对数组名取地址不会降级:&arr; 直接采用数组名arr则会降一级别；逐步进行 * 操作也会使得数组指针逐步降级(最后一次*是取出变量值);
    // 几级指针代表，自增1，会增加多少增量，eg:二级指针对应二维数组，自增1会增加整个二维数组元素个数；同理，一级指针也即行指针对应一维数组，自增1会增加
    // 整个一维数组元素个数；列指针自增1会增加数组里面单个元素。
    // 指针无法同时完成降级再自增一个地址eg:*p++;除非一开始就降级为需要的的指针，降级之后的指针再单独自增;此外数组传参时，形参数组最好填写齐全防止出错。

    // 首地址
    //&arr1 和 arr1 和 &arr1[0]代表同一地址，但是意义不一样，对数组名取地址&arr1,则表示同级别数组指针，自增1，会增加整个数组长度
    //  直接使用数组名，则会退化一级别，arr1,自增1，会增加一个元素长度大小；同样，对数组名进行 * 操作也会将数组退化一级别（最后一个*表示取这个元素），二维数组

    // arr[][],&arr表示同级别的二维数组指针，直接使用数组名arr会退化一级别变为一维数组指针也就是行指针，不断使用 * 操作也会使得数组指针不断降级别。
    // arr1[0]表示一个元素，对其取地址则是这个元素的地址，即 &arr1[0] 和 arr1一样地址。

#if 0

    int arr1[5] = {1, 2, 3, 4, 5};

    printf("arr1 =%p, &arr1[0] = %p, &arr1 = %p\n", arr1, &arr1[0], &arr1);

    int* p1 = arr1;
    int* p2 = &arr1[0];
    int (*p3)[5] = &arr1;
    
    printf("*p1 = %d, *p2 = %d, *p3 = %d\n", *p1, *p2, *p3);
    printf("p1 = %p, p2 = %p, p3 = %p\n", p1, p2, p3);
    
    p1++;
    p2++;
    p3++;


    printf("*p1 = %d, *p2 = %d, *p3 = %d\n", *p1, *p2, **p3);
    printf("p1 = %p, p2 = %p, p3 = %p\n", p1, p2, p3);
#endif

#if 0
    int arr2[3][2] = {{6, 5}, {4, 3}, {2, 1}};

    int(*p1)[3][2] = &arr2; // 对数组名取地址会得到同级别的数组指针，p1为二维数组指针，*p1降级为一维数组指针也即行指针，**p1由二维数组指针降为一维数组指针再降为列指针(单个元素变量)

    int(*p2)[2] = arr2;     // 直接采用数组名会降级，p2由二维数组指针降为一维数组指针
    int(*p3)[2] = &arr2[0]; // arr2[0],arr2[1],arr2[2]原本就是一维数组，对其取地址不会降级，仍为一维数组指针

    int *p4 = arr2[0];     // arr2[0]原本是一维数组名，直接采用名称会降级，变为列指针。
    int *p5 = &arr2[0][0]; // arr2[0][0]为元素值，对其取地址，仍然是列指针。

    printf("p1 = %p, p2 = %p, p3 = %p, p4 = %p, p5 = %p\n", p1, p2, p3, p4, p5);
    printf("***p1 = %d, **p2 = %d, **p3 = %d, *p4 = %d, *p5 = %d\n\n", ***p1, **p2, **p3, *p4, *p5);

    p1++;
    p2++;
    p3++;
    p4++;
    p5++;

    printf("p1 = %p, p2 = %p, p3 = %p, p4 = %p, p5 = %p\n", p1, p2, p3, p4, p5);
    printf("***p1 = %d, **p2 = %d, **p3 = %d, *p4 = %d, *p5 = %d\n\n", ***p1, **p2, **p3, *p4, *p5);

    p1++;
    p2++;
    p3++;
    p4++;
    p5++;

    printf("p1 = %p, p2 = %p, p3 = %p, p4 = %p, p5 = %p\n", p1, p2, p3, p4, p5);
    printf("***p1 = %d, **p2 = %d, **p3 = %d, *p4 = %d, *p5 = %d\n\n", ***p1, **p2, **p3, *p4, *p5);

    /* p1 = 000000000061FDE0, p2 = 000000000061FDE0, p3 = 000000000061FDE0, p4 = 000000000061FDE0, p5 = 000000000061FDE0
    ***p1 = 6, **p2 = 6, **p3 = 6, *p4 = 6, *p5 = 6

    p1 = 000000000061FDF8, p2 = 000000000061FDE8, p3 = 000000000061FDE8, p4 = 000000000061FDE4, p5 = 000000000061FDE4
    ***p1 = 6421988, **p2 = 4, **p3 = 4, *p4 = 5, *p5 = 5

    p1 = 000000000061FE10, p2 = 000000000061FDF0, p3 = 000000000061FDF0, p4 = 000000000061FDE8, p5 = 000000000061FDE8
    ***p1 = 6422000, **p2 = 2, **p3 = 2, *p4 = 4, *p5 = 4
     */
#endif

    int arr[3][3] = {{9, 8, 7}, {6, 5, 4}, {3, 2, 1}};

    //对于形参全是指针时，实参传递的什么(数组对应的)指针类型，形参就应该是什么指针类型；
    //唯一特殊情况，直接传递数组名，此时形参既可采用数组名也可采用对用的数组指针名(注意直接采用数组名会降级)，
    //此时形参类型eg：对于二维数组而言,既可以采用相同的二维数组类型，也可采用一维数组指针(行指针)(二维数组直接使用数组名会降级为一维数组指针)
    PrintArrA(&arr, 9);//二维数组指针
    PrintArrB(arr, 9);//一维数组指针(行指针)或者同类型二维数组名，t同下一个
    PrintArrC(&arr[0],9);//同上一个行指针
    PrintArrD(arr[0],9);//arr[0]原本为一维数组，直接使用数组名会降级为列指针
    
    system("pause");

    return 0;
}